# PlanViewLevel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlanViewLevel Property
ParameterTypeId Class See Also
---
"Associated Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlanViewLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlanViewLevel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlanViewLevel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace